САС_Центр/src/InformationRegisters/Инциденты/Инциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Инциденты</name>
  <resources>
    <name>Хэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

САС_Центр/src/InformationRegisters/ИнцидентыКОбработкеYandexGPT/ИнцидентыКОбработкеYandexGPT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнцидентыКОбработкеYandexGPT</name>
  <resources>
    <name>ТекстОтчетаJSON</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>DocumentRef.Инцидент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

САС_Центр/src/Documents/Инцидент/Инцидент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инцидент</name>
  <attributes>
    <name>ТекстОтчетаJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветYandexGPT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрисоединенныеФайлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ПрисоединённыеФайлыИнциденты</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

САС_Центр/src/Catalogs/ПрисоединённыеФайлыИнциденты/ПрисоединённыеФайлыИнциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрисоединённыеФайлыИнциденты</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Инцидент</name>
    <type>
      <types>DocumentRef.Инцидент</types>
    </type>
  </attributes>
</mdclass:Catalog>

САС_Центр/src/CommonModules/САС_Сервер/Module.bsl
// Процедура ОбработатьДамп
//
// Описание: 	Вызывается из http-сервиса PushReport. 
// 				Вытаскивает информацию из zip-файла полученного по PushReport.
//				Создает задачу, прицепляет к задаче файлы.
//
// Параметры:
// ДанныеОтчета - Двоичные данные
//
Процедура ОбработатьДамп(ДанныеОтчета) Экспорт 
	
	ИнформацияОтчета 		  = ПолучитьИнформациюИзОтчета(ДанныеОтчета);
	ИнформацияОтчетаСтруктура = ИнформацияОтчета.ReportStructure;
	
	АппСтэк = ЗначениеСвойства(ИнформацияОтчетаСтруктура, "errorInfo.applicationErrorInfo.stackHash");
	Если АппСтэк <> Неопределено Тогда
		// Ошибка возникла в коде конфигурации
		ТекстОшибки = ЗначениеСвойства(ИнформацияОтчетаСтруктура, "errorInfo.applicationErrorInfo");
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ТекстОшибки);
		СтрокаОшибки = ЗаписьJSON.Закрыть();
		
		ТекЗадача = СоздатьЗадачу(ИнформацияОтчетаСтруктура, СтрокаОшибки);
		
		ддОтчет = ПолучитьДвоичныеДанныеИзСтроки(ИнформацияОтчета.Report, "UTF-8");
		ддСкрин = ИнформацияОтчета.Screenshot.Получить();
		ПрицепитьФайлы(ТекЗадача, ддОтчет, ддСкрин);
		
		ХэшОшибки = "" 	+ ИнформацияОтчетаСтруктура.configInfo.hash + "-" 
			+ ИнформацияОтчетаСтруктура.errorInfo.systemErrorInfo.clientStackHash + "-" 
				+ АппСтэк;
		
		ЗаписатьОшибкуВРегистр(ТекЗадача, ХэшОшибки);
		
	Иначе
		// ошибка возникла во внешнем отчете или обработке
		СтрокаОшибки =	ИнформацияОтчетаСтруктура.errorInfo.applicationErrorInfo.errors[0][0] 
			+ Символы.ПС  
				+ ИнформацияОтчетаСтруктура.errorInfo.applicationErrorInfo.errors[1][0];
		АппСтэк  = Новый ХешированиеДанных(ХешФункция.SHA1) ;
		АппСтэк.Добавить(СтрокаОшибки);
		ХэшАппСтэк = СтрЗаменить(АппСтэк.ХешСумма, " ", "");
		
		ХэшОшибки = "" 	+ ИнформацияОтчетаСтруктура.configInfo.hash + "-" 
			+ ИнформацияОтчетаСтруктура.errorInfo.systemErrorInfo.clientStackHash + "-" 
				+ ХэшАппСтэк;
		
		НайденныйХэш = НайтиХэш(ХэшОшибки);
		
		Если НайденныйХэш <> Неопределено Тогда
			// Ошибка во внешней обработке. Такая ошибка уже зарегистрирована. 
			// Ничего делать не надо
			Возврат;
		Иначе 
			Инцидент = СоздатьЗадачу(ИнформацияОтчетаСтруктура, СтрокаОшибки);
			
			ддОтчет = ПолучитьДвоичныеДанныеИзСтроки(ИнформацияОтчета.Report, "UTF-8");
			ддСкрин = ИнформацияОтчета.Screenshot.Получить();
			ПрицепитьФайлы(Инцидент, ддОтчет, ддСкрин);
			
			ХэшОшибки = "" 	+ ИнформацияОтчетаСтруктура.configInfo.hash + "-" 
				+ ИнформацияОтчетаСтруктура.errorInfo.systemErrorInfo.clientStackHash + "-" 
					+ ХэшАппСтэк;
			
			ЗаписатьОшибкуВРегистр(Инцидент, ХэшОшибки);
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОбработатьДамп

Функция ЗначениеСвойства(Структура, ПутьКСвойству) Экспорт
	
	Путь = СтрРазделить(ПутьКСвойству, ".", Ложь);
	
	ТекущийОбъект = Структура;
	
	Для Каждого ЧастьПути Из Путь Цикл 
		Если Не ТекущийОбъект.Свойство(ЧастьПути) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТекущийОбъект = ТекущийОбъект[ЧастьПути];
		
	КонецЦикла;
	
	Возврат ТекущийОбъект;
	
КонецФункции

// Процедура ЗаписатьОшибкуВРегистр(ТекЗадача, ХэшОшибки);
//
// Описание: Записывает в регистр сведений текущую ошибку
//				В дальнейшем по хэшу проверяет не зарегистрирована ли ошибка ранее
//
// Параметры:
//				ТекЗадача - Справочники.узЗадачи - ссылка на задачу по ошибке
//				ХэшОшибки - Строка - уникальный хэш ошибки (одинаковый для одной и той же ошибки)
//
Процедура ЗаписатьОшибкуВРегистр(Инцидент, ХэшОшибки)
	
	ТекЗапись = РегистрыСведений.Инциденты.СоздатьМенеджерЗаписи();
	ТекЗапись.Хэш = ХэшОшибки;
	ТекЗапись.Прочитать();
	ТекЗапись.Инцидент = Инцидент;
	ТекЗапись.Записать();
	
КонецПроцедуры // ЗаписатьОшибкуВРегистр

// Функция ПрицепитьФайл
//
// Описание: Прицепляет к задаче файл отчета и скриншот
//
//
// Параметры:
//			ТекЗадача - Справочник.узЗадачи - владелец файлов
//			пОтчет - Двоичные данные - XML отчета в виде двоичных данных
//			пСкриншот - Двоичные данные - скриншот в виде двоичных данных
//
//
Процедура ПрицепитьФайлы(Инцидент, пОтчет, пСкриншот)
	
	// Создаём элемент в справочнике
	НовыйФайл = Справочники.ПрисоединённыеФайлыИнциденты.СоздатьЭлемент();
	НовыйФайл.Наименование = "Скриншот_" + Инцидент.Номер;
	//НовыйФайл.ИмяФайла = ПолучитьИмяФайлаИзПути(ПутьКФайлу);
	НовыйФайл.Расширение = ".png";
	НовыйФайл.ДанныеФайла = Новый ХранилищеЗначения(пСкриншот);
	НовыйФайл.Инцидент = Инцидент;
	//НовыйФайл.ДатаСоздания = ТекущаяДата();
	НовыйФайл.Записать();
	
	ИнцидентОбъект = Инцидент.ПолучитьОбъект(); 
	
	НоваяСтрока = ИнцидентОбъект.ПрисоединенныеФайлы.Добавить();
	НоваяСтрока.Файл = НовыйФайл.Ссылка;
	НоваяСтрока.РасширениеФайла = НовыйФайл.Расширение;
	
	НовыйФайл = Справочники.ПрисоединённыеФайлыИнциденты.СоздатьЭлемент();
	НовыйФайл.Наименование = "Отчет_" + Инцидент.Номер;
	//НовыйФайл.ИмяФайла = ПолучитьИмяФайлаИзПути(ПутьКФайлу);
	НовыйФайл.Расширение = ".json";
	НовыйФайл.ДанныеФайла = Новый ХранилищеЗначения(пОтчет);
	НовыйФайл.Инцидент = Инцидент;
	//НовыйФайл.ДатаСоздания = ТекущаяДата();
	НовыйФайл.Записать();
	
	// Добавляем ссылку на файл в табличную часть документа
	
	НоваяСтрока = ИнцидентОбъект.ПрисоединенныеФайлы.Добавить();
	НоваяСтрока.Файл = НовыйФайл.Ссылка;
	НоваяСтрока.РасширениеФайла = НовыйФайл.Расширение;
	
	ИнцидентОбъект.Записать();
	
КонецПроцедуры // ПрицепитьФайл


// Описание: Создает задачу из структуры отчета об ошмбке
//
//
// Параметры:
// ИнформацияОтчетаСтруктура - Структура - из XML файла report.json
// СтрокаОшибки - Строка - строка для описания ошибки в задаче
//
// Возвращаемое значение:
//  	Справочник.узЗадачи.Ссылка - ссылка на созданный документ
//
Функция СоздатьЗадачу(ИнформацияОтчетаСтруктура, СтрокаОшибки)
	ФД = Новый ФорматированныйДокумент;
	ИмяПриложения = ЗначениеСвойства(ИнформацияОтчетаСтруктура, "configInfo.description");
	ИмяПользователя = ЗначениеСвойства(ИнформацияОтчетаСтруктура, "sessionInfo.userName");
	
	ДокНаименование = 	"У пользователя " 
	+ ИмяПользователя 
	+ " возникла ошибка в " 
	+ ИмяПриложения;
	
	Элем = ФД.Добавить(ДокНаименование);
	Элем = фд.Добавить(Символы.ПС + Символы.ПС);
	Элем = ФД.Добавить(СтрокаОшибки);
	
	ДокументИнцидент = Документы.Инцидент.СоздатьДокумент();
	ДокументИнцидент.Дата = ТекущаяДата();
	ДокументИнцидент.ТекстОтчетаJSON = СтрокаОшибки;

	////ДокументИнцидент.Наименование = ДокНаименование;
	////ДокументИнцидент.Содержание = Новый ХранилищеЗначения(ФД);
	////
	////ДокументИнцидент.ОформлениеТекста = ПредопределенноеЗначение("Перечисление.узОформлениеТекста.ФорматированныйТекст");
	//////ДокЗадача.Автор = Пользователи.ТекущийПользователь();
	////ДокументИнцидент.Важность = ПредопределенноеЗначение("Справочник.узВариантыВажностиЗадачи.Обычная");
	////ДокументИнцидент.Статус = ПредопределенноеЗначение("Справочник.узСтатусыЗадачи.ЗапросНаДобавление");
	////ДокументИнцидент.ПоказыватьВОтчетахИКанбанДоске = Истина;
	////ДокументИнцидент.Исполнитель = ДокументИнцидент.Автор;
	Попытка
		ДокументИнцидент.Записать();
	Исключение
		Инф = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	// Второй раз записываем, чтобы С пустым Родителем уставноить ЭтоОсновнаяЗадача в Ложь
	//ДокументИнцидент.ЭтоОсновнаяЗадача = Ложь;
	ДокументИнцидент.Записать();
	
	Возврат ДокументИнцидент.Ссылка;    
КонецФункции // СоздатьЗадачу

Функция ПолучитьИнформациюИзОтчета(ДанныеОтчета) 
	
	Отчет = Неопределено;
	ОтчетСтруктура = Неопределено;
	Скриншот = Неопределено;
	
	ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл 
		Если Элемент.Имя = "report.json" Тогда
			
			ПутьКПапкеReportJson = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеReportJson);
			
			ЧтениеТекста = Новый ЧтениеТекста(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json", 
												КодировкаТекста.UTF8);
			Отчет = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
			ЧтениеJson = Новый ЧтениеJSON();
			ЧтениеJson.ОткрытьФайл(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json");
			ОтчетСтруктура = ПрочитатьJSON(ЧтениеJson);			
			ЧтениеJson.Закрыть();
			
			УдалитьФайлы(ПутьКПапкеReportJson);
			
		ИначеЕсли Элемент.Имя = "screenshot.png" Тогда
			
			ПутьКПапкеScreenshot = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеScreenshot);
			Картинка = Новый ДвоичныеДанные(ПутьКПапкеScreenshot + ПолучитьРазделительПути() + "screenshot.png");
			Скриншот = Новый ХранилищеЗначения(Картинка);
			УдалитьФайлы(ПутьКПапкеScreenshot);
			
		Иначе
			// ничего не делаем. Других файлов в архиве нет.
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Report, ReportStructure, Screenshot", Отчет, ОтчетСтруктура, Скриншот); 
	
КонецФункции

Функция НайтиХэш(ХэшОшибки) Экспорт 
	
	Рез = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инциденты.Хэш КАК Хэш,
	|	Инциденты.Инцидент КАК Инцидент
	|ИЗ
	|	РегистрСведений.Инциденты КАК Инциденты
	|ГДЕ
	|	Инциденты.Хэш = &Хэш";
	
	Запрос.УстановитьПараметр("Хэш", ХэшОшибки);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Рез = РезультатЗапроса.Задача;	
	КонецЦикла;  
	
	Возврат Рез;
	
КонецФункции  

Функция ПолучитьИмяФайлаИзПути(ПолныйПуть)
	
	ПозицияРазделителя = СтрНайти(ПолныйПуть, "\", НаправлениеПоиска.СКонца);
    Если ПозицияРазделителя > 0 Тогда
        Возврат Сред(ПолныйПуть, ПозицияРазделителя + 1);
    Иначе
        Возврат ПолныйПуть;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРасширениеФайла(ПолныйПуть)
    ПозицияТочки = СтрНайти(ПолныйПуть, ".", НаправлениеПоиска.СКонца);
    Если ПозицияТочки > 0 Тогда
        Возврат Сред(ПолныйПуть, ПозицияТочки);
    Иначе
        Возврат "";
    КонецЕсли;
КонецФункции


Процедура ОтправкаЗапросовYandexGPT() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнцидентыКОбработкеYandexGPT.Инцидент КАК Инцидент,
	|	ИнцидентыКОбработкеYandexGPT.ОтветПолучен КАК ОтветПолучен,
	|	ИнцидентыКОбработкеYandexGPT.ТекстОтчетаJSON КАК ТекстОтчетаJSON
	|ИЗ
	|	РегистрСведений.ИнцидентыКОбработкеYandexGPT КАК ИнцидентыКОбработкеYandexGPT
	|ГДЕ
	|	НЕ ИнцидентыКОбработкеYandexGPT.ОтветПолучен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОтветYandexGPT = ЯндексGPT.ОтправитьЗапросКYandexGPT(
		"Разбери ошибку из текста JSON для 1С. Дай полный анализ, напиши рекомендации по исправлению. Классифицируй ошибки по видам (Программная или аналитическая). Дай развернутый ответ. Текст:" 
		+ Символы.ПС + ВыборкаДетальныеЗаписи.ТекстОтчетаJSON);
		
		МенеджерЗаписи = РегистрыСведений.ИнцидентыКОбработкеYandexGPT.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи); 
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ОтветПолучен = Истина;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		
		ИнцидентОбъект = ВыборкаДетальныеЗаписи.Инцидент.ПолучитьОбъект();
		ИнцидентОбъект.ОтветYandexGPT = ОтветYandexGPT;
		ИнцидентОбъект.ОтветПолучен = Истина; 
		
		Попытка
			ИнцидентОбъект.Записать();
		Исключение 
			ИнфОш = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры
